<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 日志记录方式，内置 file socket 支持扩展
    'type'        => 'File',
    // 日志保存目录
    'path'        => '../logs/',
    // 日志记录级别
    'level'       => [],
    // 单文件日志写入
    'single'      => false,
    // 独立日志级别
    'apart_level' => [],
    // 最大日志文件数量
    'max_files'   => 0,
    // 是否关闭日志写入
    'close'       => true,
];
// 权限认证 配置
return [
    'AUTH_CONFIG' => [
            'AUTH_ON' => true,  // 认证开关
            'AUTH_TYPE' => 1, // 认证方式，1为实时认证；2为登录认证。
            'AUTH_GROUP' => 'shop_group', // 用户组数据表名
            'AUTH_GROUP_ACCESS' => 'shop_group_access', // 用户-用户组关系表
            'AUTH_RULE' => 'shop_rule', // 权限规则表
        ],
        
        'url_route_on' => true,
        'log'          => [
            'type' => 'trace', // 支持 socket trace file
        ], 
       
       
    
    ];
